Revit 2027 API
ConnectorElement.Origin Property
The location of the connector in family document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual XYZ Origin { get; }
Public Overridable ReadOnly Property Origin As XYZ
	Get
public:
virtual property XYZ^ Origin {
	XYZ^ get ();
}
abstract Origin : XYZ with get
override Origin : XYZ with get
Property Value
XYZ
Implements
IConnector.Origin
See Also
Reference
ConnectorElement Class
Autodesk.Revit.DB Namespace